class_diagram.md
```mermaid
classDiagram
    direction TB

    class Usuario {
        +int id
        +string nombre
        +string email
        +string password_hash
        +string estado
        +datetime fecha_registro
    }

    class Proyecto {
        +int id
        +string titulo
        +string descripcion
        +datetime fecha_creacion
        +datetime fecha_actualizacion
        +json datos_diagrama
    }

    class DetalleProyecto {
        +int id
        +string rol
        +datetime fecha_asignacion
    }

    Usuario "1" -- "0..*" Proyecto : propietario >
    Usuario "1" -- "0..*" DetalleProyecto : usuario >
    Proyecto "1" -- "0..*" DetalleProyecto : proyecto >
```
